import Image from "next/image";

import { Separator } from "@/components/ui/separator";

export default function Technology() {
  return (
    <div className="w-full grid md:grid-cols-2 gap-2 lg:gap-4 xl:gap-8">
      <div className="flex flex-col gap-2 p-1">
        <h1 className="text-center">Технологія</h1>
        <p>
          Технологія вакуумного напилення (фізичне відкладення парової фази,
          PVD) - процес, за якого тонкі шари матеріалу відкладаються на поверхні
          іншого матеріалу.
        </p>
        <p>
          Матеріал, який потрібно відкласти на поверхню, нагрівається до високої
          температури, випаровується з подальшим конденсуванням на поверхні
          деталі, утворюючи тонкий шар.
        </p>
        <p>
          В якості матеріалу можуть виступати метали, кераміка, пластик, скло
          тощо. Ця технологія широко застосовується в багатьох галузях, зокрема
          у виробництві напівпровідників, аерокосмічій, автомобільній, медичній,
          електроніка тощо.
        </p>
        <p>
          Основними перевагами вакуумного напилення є висока якість тонкого
          шару, дуже малі розміри і товщина шару, висока адгезія до поверхні,
          висока чистота та точність розміщення матеріалу на поверхні.
        </p>
      </div>
      <div className="relative hidden md:block">
        <Image
          priority
          src="/tech.jpg"
          alt="Виробниче устаткування"
          fill
          sizes="(max-width: 768px) 100vw, 400px"
          className="object-cover w-[400px] h-auto"
        />
      </div>
      <div className="md:col-span-2 flex flex-col gap-2 p-1">
        <h3 className="text-center pt-0">Переваги технології:</h3>
        <p>
          <span className="font-semibold mr-2">Висока якість покриття:</span>
          вакуумне напилення забезпечує однорідне, безпомилкове покриття, яке
          має високу адгезію до поверхні.
        </p>
        <p>
          <span className="font-semibold mr-2">Висока точність:</span>
          технологія вакуумного напилення дозволяє контролювати товщину покриття
          з високою точністю, що дозволяє досягти потрібної якості продукту.
        </p>
        <p>
          <span className="font-semibold mr-2">Економія матеріалів:</span>
          вакуумне напилення вимагає менше матеріалів для покриття поверхні
          порівняно з іншими технологіями, що дозволяє зменшити витрати на
          матеріали.
        </p>
        <p>
          <span className="font-semibold mr-2">
            He впливає на властивості матеріалу:
          </span>
          технологія вакуумного напилення не змінює фізичні та хімічні
          властивості матеріалу, що дозволяє зберігати його властивості.
        </p>
        <p>
          <span className="font-semibold mr-2">Висока стійкість:</span>
          покриття, отримане за допомогою вакуумного напилення, має високу
          стійкість до зносу, корозії та інших впливів навколишнього середовища.
        </p>
        <p>
          <span className="font-semibold mr-2">Безпека:</span> вакуумне
          напилення є безпечним для довкілля та людей, оскільки не використовує
          хімічні речовини, що можуть бути шкідливими.
        </p>
        <p>
          Такі переваги дозволяють технології вакуумного напилення бути корисною
          в багатьох галузях, включаючи медицину, електроніку, виробництво
          напівпровідників, промисловість та інші.
        </p>
        <Separator className="hidden md:block md:my-2 lg:my-3 xl:my-4" />
        <h3 className="text-center pt-0">Етапи технологічного процесу:</h3>
        <ol className="flex flex-col gap-2">
          <li>
            <p>
              <span className="mr-2">1.</span> Підготовка матеріалу або виробу,
              який буде оброблятись, за допомогою ретельної механічної та
              електрохімічної обробки.
            </p>
          </li>
          <li>
            <p>
              <span className="mr-2">2.</span> Знегазування вакуумом
              безпосередньо в установці.
            </p>
          </li>
          <li>
            <p>
              <span className="mr-2">3.</span> Іонне очищення поверхні для
              підвищення якості покриття.
            </p>
          </li>
          <li>
            <p>
              <span className="mr-2">4.</span> Розпилення покриття нітриду
              титану на поверхню виробу.
            </p>
          </li>
          <li>
            <p>
              <span className="mr-2">5.</span> Формування нітрид-титанової
              плівки на поверхні виробу.
            </p>
          </li>
          <li>
            <p>
              <span className="mr-2">6.</span> Термічна обробка плівки при
              температурі, що дещо перевищує температуру розпилення, для
              закріплення ефекту покриття.
            </p>
          </li>
        </ol>
      </div>
    </div>
  );
}
